#+TITLE: Graphql Node Backend
#+PROPERTY: header-args :dir ~/ii/learning/graphql/
#+PROPERTY: header-args:shell :results output replace drawer
#+PROPERTY: header-args:js :dir ~/ii/learning/graphql/hackernews-node/src :results silent :noweb yes :mkdirp yes
#+PROPERTY: header-args:json :mkdirp yes

* Create the Project
  
  We'll set up some basic scaffolding for the project.  We want an npm module and we want graphql-yoga.
  Graphql-yoga will act as our backend server.  It is based on the common node server [[https://expressjs.com/][Express]], but optimized to be Grapqhl spec-compliant and work well as a dev experience (tie into the graphql playground and ability to be deployed anywhere.)
  
  This entire tutorial is sponsored by Prisma, and graphql-yoga is a prisma server.  Prisma is also free and open source, but I'm not sure if there's better quality servers available. Their tutorials are supremely helpful, so I am trusting their tools too.  [[https://oss.prisma.io/content/graphql-yoga/01-overview][Find out more about graphql-yoga on its homepage]].
  
  bcrypt and jsonwebtoekn are used for authentication
  
  #+NAME: Create the Project
  #+BEGIN_SRC shell :results output replace drawer
    mkdir hackernews-node
    cd hackernews-node
    npm init -y
    npm install graphql-yoga jsonwebtoken bcryptjs
    mkdir src
    touch src/index.js
  #+END_SRC

  This gives us the following package.json
  
  #+NAME: Our Package.json
  #+BEGIN_SRC shell :results output replace drawer
  cat hackernews-node/package.json
  #+END_SRC

  #+RESULTS: Our Package.json
  :RESULTS:
  {
    "name": "hackernews-node",
    "version": "1.0.0",
    "main": "index.js",
    "scripts": {
      "test": "echo \"Error: no test specified\" && exit 1"
    },
    "keywords": [],
    "author": "",
    "license": "ISC",
    "description": "",
    "dependencies": {
      "bcryptjs": "^2.4.3",
      "graphql": "^14.3.1",
      "graphql-yoga": "^1.17.4",
      "jsonwebtoken": "^8.5.1",
      "prisma-client-lib": "^1.34.0"
    }
  }
  :END:
  
  And the following file structure;
  
  #+NAME: File Structure
  #+BEGIN_SRC shell :results output replace drawer
    tree -I "node_modules" hackernews-node/ 
  #+END_SRC

  #+RESULTS: File Structure
  :RESULTS:
  hackernews-node/
  ├── package.json
  ├── package-lock.json
  └── src
      └── index.js

  1 directory, 3 files
  :END:

* Setting Up Prisma
  
  Once we've set up a few queries and  mutations (see our [[*src]]), we'll want to start storing them in a database, and we'll want to start writing more complex queries.  This tutorial uses Prisma (its server and client) to simplify this process for us.  Essentially, Prisma acts as a layer between our client writing graphql queries and our server and database which needs to know hwo to turn them into db calls.  What it will end up doing is writing the complex resolver functions for us, based on the simple declarative ones we give it.  This made be too much sugar/magic, but the alternative is writing raw sql queries for every single resolve we have, which I dont' much wanna do.
  
#+NAME: Setting up Prisma  
#+BEGIN_SRC shell
  mkdir hackernews-node/prisma
  cd hackernews-node/prisma
  touch prisma.yml
  touch datamodel.prisma
#+END_SRC

Our project structure is now
#+BEGIN_SRC shell
tree -I "node_modules" hackernews-node 
#+END_SRC

#+RESULTS:
:RESULTS:
hackernews-node
├── index.js
├── package.json
├── package-lock.json
├── prisma
│   ├── datamodel.prisma
│   └── prisma.yml
└── src
    ├── index.js
    └── schema.graphql

2 directories, 7 files
:END:

Lastly, we'll install a prisma client cli.  This helps us deploy our app, and generate all our boilerplate code based on our datamodel.

#+BEGIN_SRC shell
npm install --global prisma
#+END_SRC

#+BEGIN_SRC shell
  cd hackernews-node
  npm install prisma-client-lib
#+END_SRC

#+RESULTS:
:RESULTS:
+ prisma-client-lib@1.34.0
added 55 packages from 84 contributors and audited 502 packages in 5.297s
found 0 vulnerabilities

:END:

*** Intro  
   We want to have a more modular setup, so as our resolvers expanded in [[*index.js]], it was necessary to split them out here.
   
   Let's make sure we have a resolvers directory first:
   
   #+BEGIN_SRC shell 
     mkdir hackernews-node/src/resolvers
     tree -I 'node_modules' hackernews-node
   #+END_SRC

   #+RESULTS:
   :RESULTS:
   hackernews-node
   ├── index.js
   ├── package.json
   ├── package-lock.json
   ├── prisma
   │   ├── datamodel.prisma
   │   └── prisma.yml
   ├── src
   │   ├── generated
   │   │   └── prisma-client
   │   │       ├── index.d.ts
   │   │       ├── index.js
   │   │       └── prisma-schema.js
   │   ├── index.js
   │   ├── resolvers
   │   └── schema.graphql
   └── xclip

   5 directories, 11 files
   :END:
   
